{
    "format": "layers-model",
    "generatedBy": "keras v3.4.1",
    "convertedBy": "TensorFlow.js Converter v4.20.0",
    "modelTopology": {
        "keras_version": "3.4.1",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_3",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [null, 23, 1],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_3"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 2,
                            "kernel_size": [12],
                            "strides": [1],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [1],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": "kernel"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Permute",
                        "config": {
                            "name": "permute_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "dims": [2, 1]
                        }
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "name": "reshape_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "target_shape": [24]
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 24,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ],
                "build_input_shape": [null, 23, 1]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": ["group1-shard1of1.bin"],
            "weights": [
                {
                    "name": "conv1d_1/kernel",
                    "shape": [12, 1, 2],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_1/bias",
                    "shape": [2],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [24, 24],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [24],
                    "dtype": "float32"
                }
            ]
        }
    ]
}
